# count = count + 3  # count += 3
# Операции присваивания = += -= *= //= ...
# Операции сравнения == != > < >= <=
# Арифметические операции + - * / // % **
# Логические операции and or not


# 1. Возведение в степент (**)
# 2. Унарный минус (-)
# 3. Умножение, деление (* / // %)
# 4. Сложение и вычитание (+ -)
# 5. Операции сравнения (> < >= <=)
# 6. Операции равенства (== != ..)
# 7. Логические операции (or and not)
# 8. Операция присваивания (=)

# a, b => бинарная операция: a + b, a - b
# a => унарная операция: -a

x = int(input())
result = 0 < x < 10
if result:
    print("Верно")
else:
    print("Неверно")
